src/test/resources/org/lockss/ws/status/queryTdbTitlesRequest.xml

<!--
Sample SOAP request for simple testing.

Usage:
  curl -H "content-type: text/xml" -d @path/to/this/file
       http://user:pass@host:port/ws/DaemonStatusService
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:service="http://status.ws.lockss.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:queryTdbTitles>
            <tdbTitleQuery>select *</tdbTitleQuery>
        </service:queryTdbTitles>
    </soapenv:Body>
</soapenv:Envelope>
